In [1]:
import pandas as pd
import pyodbc as pyodbc

In [3]:
conn = pyodbc.connect('Driver={SQL Server};''Server=emerge-rdbms;''Database=Clarity;''Trusted_Connection=yes')

In [4]:
sql = conn.cursor()

In [7]:
sql.execute('select top 25 hsp_account_id,convert(varchar,adm_date_time,101), hsp_account_name from hsp_account where hsp_account_id is not null and adm_date_time is not null')

In [8]:
accounts = pd.DataFrame.from_records(sql.fetchall(),columns=[desc[0] for desc in sql.description])

In [11]:
accounts.columns = ['hars','admit_date','pat_name']

In [12]:
accounts

      hars  admit_date                    pat_name
0    31739  01/18/2018           LOMBARDI,MARYBETH
1    31740  01/18/2018                CHAN,MICHAEL
2    31741  01/19/2018                 FINN,EVELYN
3    31743  01/17/2018            SANCHEZ,VERONICA
4    31795  01/23/2018              ROMERO,MAYRA A
5    32166  02/06/2018                 BENSON,GARY
6    32458  02/23/2018       ZAVALA LAZO,GENESIS J
7    32459  02/14/2018    CASTILLOROJAS,DAVID LUIZ
8    32603  02/20/2018                SHRESTHA,RAM
9    32673  02/27/2018                 WEBER,DAVID
10   32754  03/05/2018          ABELARD,LAURADJINE
11   33088  03/23/2018               WOLFE,SARAH C
12   33157  03/27/2018  SEPULVEDAGUERRERO,ANEUDY R
13   33204  03/23/2018          SLYMAN,LEVITICUS J
14   33229  03/28/2018              NORTON,LYNNE M
15   33861  03/29/2018      GUEVARATAYLOR,JONATHAN
16  867663  04/03/2018          ESKAROUS,MAKARIOUS
17  886870  04/04/2018                POOLE,LEON A
18  888582  04/04/2018                ATWELL,EBONY
19  923255  04/04/2018        PROCTORTIRADO,SOPHIA
20  929795  04/03/2018                CHESTER,KARL
21  935342  04/04/2018              THOMAS,LEIYA L
22  938157  03/30/2018         BRIERCHECK,EDWARD L
23  943865  04/04/2018                CHESTER,KARL
24  951452  04/05/2018              GREENLAW,CELIA

In [26]:
naccounts = accounts[accounts['pat_name'].str.contains('ER')]

In [30]:
naccounts['admit_date'].dtypes

dtype('O')

In [31]:
naccounts['admit_date'] = pd.to_datetime(naccounts['admit_date'])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [35]:
naccounts

      hars admit_date                    pat_name
3    31743 2018-01-17            SANCHEZ,VERONICA
4    31795 2018-01-23              ROMERO,MAYRA A
9    32673 2018-02-27                 WEBER,DAVID
12   33157 2018-03-27  SEPULVEDAGUERRERO,ANEUDY R
20  929795 2018-04-03                CHESTER,KARL
22  938157 2018-03-30         BRIERCHECK,EDWARD L
23  943865 2018-04-04                CHESTER,KARL

In [38]:
naccounts[naccounts['admit_date'] > '2018-03-01']

      hars admit_date                    pat_name
12   33157 2018-03-27  SEPULVEDAGUERRERO,ANEUDY R
20  929795 2018-04-03                CHESTER,KARL
22  938157 2018-03-30         BRIERCHECK,EDWARD L
23  943865 2018-04-04                CHESTER,KARL

In [47]:
naccounts = naccounts.set_index(['admit_date'])

KeyError: "None of ['admit_date'] are in the columns"

In [46]:
naccounts.loc['2018-02-01':'2018-04-01']

              hars                    pat_name
admit_date
2018-02-27   32673                 WEBER,DAVID
2018-03-27   33157  SEPULVEDAGUERRERO,ANEUDY R
2018-03-30  938157         BRIERCHECK,EDWARD L

In [48]:
naccounts.loc['2018-02-01':'2018-04-01'].reset_index()

  admit_date    hars                    pat_name
0 2018-02-27   32673                 WEBER,DAVID
1 2018-03-27   33157  SEPULVEDAGUERRERO,ANEUDY R
2 2018-03-30  938157         BRIERCHECK,EDWARD L

In [49]:
mask = (df['date'] > '2000-6-1') & (df['date'] <= '2000-6-10')
print(df.loc[mask])

              hars                    pat_name
admit_date
2018-01-17   31743            SANCHEZ,VERONICA
2018-01-23   31795              ROMERO,MAYRA A
2018-02-27   32673                 WEBER,DAVID
2018-03-27   33157  SEPULVEDAGUERRERO,ANEUDY R
2018-04-03  929795                CHESTER,KARL
2018-03-30  938157         BRIERCHECK,EDWARD L
2018-04-04  943865                CHESTER,KARL

In [57]:
naccounts.loc[(naccounts['admit_date'] > '2018-02-01') & (naccounts['admit_date'] <= '2018-04-01')]

  admit_date    hars                    pat_name
2 2018-02-27   32673                 WEBER,DAVID
3 2018-03-27   33157  SEPULVEDAGUERRERO,ANEUDY R
5 2018-03-30  938157         BRIERCHECK,EDWARD L

In [62]:
naccounts = naccounts.set_index(['admit_date'])

In [63]:
naccounts.loc['2018-02-01':'2018-04-01']

              hars                    pat_name
admit_date
2018-02-27   32673                 WEBER,DAVID
2018-03-27   33157  SEPULVEDAGUERRERO,ANEUDY R
2018-03-30  938157         BRIERCHECK,EDWARD L